artillery.yml
config:
  target: "http://localhost:8010"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "test health"
    flow:
      - get:
          url: "/health"

  - name: "retrieve list of rides"
    flow:
      - get:
          url: "/rides"